## DataFrames QUIZ

In [3]:
import numpy as np
import pandas as pd

In [4]:
name_table = pd.read_csv('./Data/Score.csv')

In [5]:
name_table.head(80)

              Name    Score
0    Anjolie Jones  76.1796
1   Deirdre Levine  73.3931
2   Haviva Buckner  73.5801
3       Rinah Lowe  73.5539
4   Martena Crosby  73.4312
..             ...      ...
75    Halla Gordon  73.6297
76     Jolie Mason  73.3920
77   Avye Franklin  75.0421
78   Marcia Walter  74.5931
79   Stella Dawson  75.3533

[80 rows x 2 columns]

## What is the `Name` of the student with a `Score` closest to 74.225?

In [9]:
score_closest = 74.225

In [11]:
print(name_table)

                   Name    Score
0         Anjolie Jones  76.1796
1        Deirdre Levine  73.3931
2        Haviva Buckner  73.5801
3            Rinah Lowe  73.5539
4        Martena Crosby  73.4312
..                  ...      ...
195  Germaine Castaneda  75.7015
196           Jade Bell  74.1158
197      Danielle Roman  72.6676
198      Halla Cummings  74.3708
199     Brooke Humphrey  75.6135

[200 rows x 2 columns]

In [14]:
name_table.query('74.22 < Score < 74.25')

            Name    Score
46     Bo Barker  74.2474
141  Tamara Moon  74.2385

---

# Take the DataFrame Quiz on Canvas!